package zengin

import (
	"reflect"
	"strings"
	"testing"
)

func TestParseFile(t *testing.T) {

	var mockData = `12110110999999ｹﾝｼﾝ ﾀﾛｳ                                02242606               010               20999999                 
22606ﾋﾖｳｺﾞｹﾝｼﾝｸﾐ    020ﾋﾖｳｺﾞ              19876543ｹﾝｼﾝ ｼﾖｳｼﾞ                    00000000010                    0        
22606ﾋﾖｳｺﾞｹﾝｼﾝｸﾐ    030ｻﾝﾉﾐﾔ              29999999ｹﾝｼﾝ ﾊﾅｺ                      00000000020                    0        
22606ﾋﾖｳｺﾞｹﾝｼﾝｸﾐ    030ｻﾝﾉﾐﾔ              11234567ｹﾝｼﾝ ｼﾞﾛｳ                     00000000030ﾏｲﾂｷﾌﾞﾝ             0Y       
22606ﾋﾖｳｺﾞｹﾝｼﾝｸﾐ    030ｻﾝﾉﾐﾔ              11234567ｹﾝｼﾝ ｼﾞﾛｳ                     00000000030200504001 000001    0        
8000004000000000009                                                                                                     
9`

	/*
		振込名義人, 振込日, 金融機関コード, 支店コード, 科目, 口座番号, 口座名義人, 金額,
		ｷﾔﾂｼﾕ ﾀﾛｳ, 0224, 2606, 020, 1, 9876543, ｷﾔﾂｼ ｼﾖｳｼﾞ, 1,
		ｷﾔﾂｼﾕ ﾀﾛｳ, 0224, 2606, 030, 2, 9999999, ｷﾔﾂｼ ﾊﾅｺ, 2,
		ｷﾔﾂｼﾕ ﾀﾛｳ, 0224, 2606, 030, 1, 1234567, ｷﾔﾂｼ ｼﾞﾛｳ, 3,
	*/
	expectedData := [][]string{
		{"振込名義人", "振込日", "金融機関コード", "支店コード", "科目", "口座番号", "口座名義人", "金額"},
		{"ｹﾝｼﾝ ﾀﾛｳ", "0224", "2606", "020", "1", "9876543", "ｹﾝｼﾝ ｼﾖｳｼﾞ", "1"},
		{"ｹﾝｼﾝ ﾀﾛｳ", "0224", "2606", "030", "2", "9999999", "ｹﾝｼﾝ ﾊﾅｺ", "2"},
		{"ｹﾝｼﾝ ﾀﾛｳ", "0224", "2606", "030", "1", "1234567", "ｹﾝｼﾝ ｼﾞﾛｳ", "3"},
		{"ｹﾝｼﾝ ﾀﾛｳ", "0224", "2606", "030", "1", "1234567", "ｹﾝｼﾝ ｼﾞﾛｳ", "3"},
	}

	reader := strings.NewReader(mockData)

	records, err := ParseToString(reader)
	if err != nil {
		t.Fatal(err)
	}

	if !reflect.DeepEqual(records, expectedData) {
		t.Fatalf("expected %v, got %v", expectedData, records)
	}
}
